```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_membership.organization_members["colinh-kong"] will be created
  + resource "github_membership" "organization_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "colinh-kong"
    }

  # github_membership.organization_members["hutchic"] will be created
  + resource "github_membership" "organization_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "hutchic"
    }

  # github_team.parent_teams["engineering"] will be created
  + resource "github_team" "parent_teams" {
      + create_default_maintainer = false
      + description               = "Engineering team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "engineering"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["frontend"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Frontend subteam"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "frontend"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["integrations"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Integrations subteam"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "integrations"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.team_members["colinh-kong:frontend"] will be created
  + resource "github_team_membership" "team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "colinh-kong"
    }

  # github_team_membership.team_members["colinh-kong:integrations"] will be created
  + resource "github_team_membership" "team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "colinh-kong"
    }

  # github_team_membership.team_members["hutchic:integrations"] will be created
  + resource "github_team_membership" "team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hutchic"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```